Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFF100.atdf
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB7DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1"/>
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB7DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1"/>
         <value caption="Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB8DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f"/>
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e"/>
         <value caption="PBCLKx is SYSCLK divided by 4" name="" value="0x3"/>
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2"/>
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x  7)" name="" value="0x1"/>
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB8DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1"/>
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB8DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1"/>
         <value caption="Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Switching Slewing Active Status bit" name="SLEWCON__BUSY">
         <value caption="Clock frequency is being actively slewed to the new frequency" name="" value="0x1"/>
         <value caption="Clock switch has reached its final value" name="" value="0x0"/>
      </value-group>
      <value-group caption="Downward Slew Enable bit" name="SLEWCON__DNEN">
         <value caption="Slewing enabled for switching to a lower frequency" name="" value="0x1"/>
         <value caption="Slewing disabled for switching to a lower frequency" name="" value="0x0"/>
      </value-group>
      <value-group caption="Upward Slew Enable bit" name="SLEWCON__UPEN">
         <value caption="Slewing enabled for switching to a higher frequency" name="" value="0x1"/>
         <value caption="Slewing disabled for switching to a higher frequency" name="" value="0x0"/>
      </value-group>
      <value-group caption="Slew Divisor Steps Control bits" name="SLEWCON__SLWDIV">
         <value caption="Steps are divide by 128" name="" value="0x7"/>
         <value caption="Steps are divide by 64" name="" value="0x6"/>
         <value caption="Steps are divide by 32" name="" value="0x5"/>
         <value caption="Steps are divide by 16" name="" value="0x4"/>
         <value caption="Steps are divide by 8" name="" value="0x3"/>
         <value caption="Steps are divide by 4" name="" value="0x2"/>
         <value caption="Steps are divide by 2" name="" value="0x1"/>
         <value caption="No divisor is used during slewing" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Clock Divide Control bits" name="SLEWCON__SYSDIV">
         <value caption="SYSCLK is divided by 16" name="" value="0xf"/>
         <value caption="SYSCLK is divided by 15" name="" value="0xe"/>
         <value caption="SYSCLK is divided by 3" name="" value="0x2"/>
         <value caption="SYSCLK is divided by 2" name="" value="0x1"/>
         <value caption="SYSCLK is not divided" name="" value="0x0"/>
      </value-group>
      <value-group caption="Fast RC Oscillator Ready Status bit" name="CLKSTAT__FRCRDY">
         <value caption="FRC is stable and ready" name="" value="0x1"/>
         <value caption="FRC is disabled for not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Primary Oscillator Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="Posc is stable and ready" name="" value="0x1"/>
         <value caption="Posc is disabled or not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Secondary Oscillator Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="Sosc is stable and ready" name="" value="0x1"/>
         <value caption="Sosc is disabled or not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low-Power RC Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1"/>
         <value caption="LPRC is disabled or not operating" name="" value="0x0"/>
      </value-group>
      <value-group caption="Divided System PLL Ready Status bit" name="CLKSTAT__DIVSPLLRDY">
         <value caption="Divided System PLL is ready" name="" value="0x2"/>
         <value caption="Divided System PLL is not ready" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00800" name="CVR" version="1">
      <register-group name="CVR">
         <register caption="Comparator Voltage Reference Control Register" name="CVRCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CVR"/>
            <bitfield caption="CVref Source Selection bit" mask="0x00000010" name="CVRSS" values="CVRCON__CVRSS"/>
            <bitfield caption="CVref Range Selection bit" mask="0x00000020" name="CVRR" values="CVRCON__CVRR"/>
            <bitfield caption="CVrefout Enable bit" mask="0x00000040" name="CVROE" values="CVRCON__CVROE"/>
            <bitfield mask="0x00000300" name="BGSEL"/>
            <bitfield mask="0x00000400" name="VREFSEL"/>
            <bitfield caption="Comparator Voltage Reference On bit" mask="0x00008000" name="ON" values="CVRCON__ON"/>
         </register>
      </register-group>
      <value-group caption="CVref Source Selection bit" name="CVRCON__CVRSS">
         <value caption="Comparator voltage reference source, CVRSRC = (VREF+) - (VREF-)" name="" value="0x1"/>
         <value caption="Comparator voltage reference source, CVRSRC = AVDD - AVSS" name="" value="0x0"/>
      </value-group>
