Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFF100.atdf
         <register caption="Interrupt Vector Address Offset Registe" name="OFF182" offset="0x818" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF183" offset="0x81c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF184" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF185" offset="0x824" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF186" offset="0x828" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF187" offset="0x82c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF188" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF189" offset="0x834" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF190" offset="0x838" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF192" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF193" offset="0x844" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF194" offset="0x848" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF196" offset="0x850" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF198" offset="0x858" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF199" offset="0x85c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF200" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF201" offset="0x864" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF202" offset="0x868" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF205" offset="0x874" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF206" offset="0x878" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF207" offset="0x87c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF208" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF209" offset="0x884" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF210" offset="0x888" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF213" offset="0x894" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7"/>
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6"/>
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5"/>
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4"/>
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3"/>
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2"/>
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1"/>
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1"/>
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
         <value caption="Single vector is presented with a shadow set" name="" value="0x1"/>
         <value caption="Single vector is not presented with a shadow set" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits " name="PRISS__PRI1SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits " name="PRISS__PRI2SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
