Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFF100.atdf
         <register caption="" name="SQI1INTSTAT" offset="0x20" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Empty Interrupt Status bit" mask="0x00000001" name="TXEMPTYIF" values="SQI1INTSTAT__TXEMPTYIF"/>
            <bitfield caption="Transmit Buffer Full Interrupt Status bit" mask="0x00000002" name="TXFULLIF" values="SQI1INTSTAT__TXFULLIF"/>
            <bitfield caption="Transmit Buffer Threshold Interrupt Status bit" mask="0x00000004" name="TXTHRIF" values="SQI1INTSTAT__TXTHRIF"/>
            <bitfield caption="Receive Buffer Empty Interrupt Status bit" mask="0x00000008" name="RXEMPTYIF" values="SQI1INTSTAT__RXEMPTYIF"/>
            <bitfield caption="Receive Buffer Full Interrupt Status bit" mask="0x00000010" name="RXFULLIF" values="SQI1INTSTAT__RXFULLIF"/>
            <bitfield caption="Receive Buffer Threshold Interrupt Status bit" mask="0x00000020" name="RXTHRIF" values="SQI1INTSTAT__RXTHRIF"/>
            <bitfield caption="Control Buffer Full Interrupt Status bit" mask="0x00000040" name="CONFULLIF" values="SQI1INTSTAT__CONFULLIF"/>
            <bitfield caption="Control Buffer Empty Interrupt Status bit" mask="0x00000080" name="CONEMPTYIF" values="SQI1INTSTAT__CONEMPTYIF"/>
            <bitfield caption="Control Buffer Threshold Interrupt Status bit" mask="0x00000100" name="CONTHRIF" values="SQI1INTSTAT__CONTHRIF"/>
            <bitfield caption="DMA Buffer Descriptor Done Interrupt Status bit" mask="0x00000200" name="BDDONEIF" values="SQI1INTSTAT__BDDONEIF"/>
            <bitfield caption="DMA Buffer Descriptor Processor Packet Complete Interrupt Status bit" mask="0x00000400" name="PKTCOMPIF" values="SQI1INTSTAT__PKTCOMPIF"/>
            <bitfield caption="DMA Bus Error Interrupt Flag bit" mask="0x00000800" name="DMAEIF" values="SQI1INTSTAT__DMAEIF"/>
         </register>
         <register caption="SQI Transmit Data Buffer Register" name="SQI1TXDATA" offset="0x24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TXDATA"/>
         </register>
         <register caption="SQI Receive Data Buffer Register" name="SQI1RXDATA" offset="0x28" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="RXDATA"/>
         </register>
         <register caption="SQI Status Register 1" name="SQI1STAT1" offset="0x2c" rw="R" size="4">
            <bitfield mask="0x0000003F" name="RXBUFCNT"/>
            <bitfield mask="0x003F0000" name="TXBUFFREE"/>
         </register>
         <register caption="SQI Status Register 2" name="SQI1STAT2" offset="0x30" rw="R" size="4">
            <bitfield caption="Transmit Buffer Overflow Status bit" mask="0x00000001" name="TXOV" values="SQI1STAT2__TXOV"/>
            <bitfield caption="Receive Buffer Underflow Status bit" mask="0x00000002" name="RXUN" values="SQI1STAT2__RXUN"/>
            <bitfield caption="SQID0 Status bit" mask="0x00000008" name="SQID0" values="SQI1STAT2__SQID0"/>
            <bitfield caption="SQID1 Status bit" mask="0x00000010" name="SQID1" values="SQI1STAT2__SQID1"/>
            <bitfield caption="SQID2 Status bit" mask="0x00000020" name="SQID2" values="SQI1STAT2__SQID2"/>
            <bitfield caption="SQID3 Status bit" mask="0x00000040" name="SQID3" values="SQI1STAT2__SQID3"/>
            <bitfield caption="Control IFO Space Available bits" mask="0x00000780" name="CONAVAIL" values="SQI1STAT2__CONAVAIL"/>
            <bitfield caption="Current Command Status bits" mask="0x00030000" name="CMDSTAT" values="SQI1STAT2__CMDSTAT"/>
         </register>
         <register caption="SQI Buffer Descriptor Control Register" name="SQI1BDCON" offset="0x34" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="SQI1BDCON__DMAEN"/>
            <bitfield caption="Buffer Descriptor Poll Enable bit" mask="0x00000002" name="POLLEN" values="SQI1BDCON__POLLEN"/>
            <bitfield caption="Buffer Descriptor Processor Start bit" mask="0x00000004" name="START" values="SQI1BDCON__START"/>
         </register>
         <register caption="SQI Buffer Descriptor Current Address Register" name="SQI1BDCURADD" offset="0x38" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BDCURRADDR"/>
         </register>
         <register caption="SQI Buffer Descriptor Base Address Register" name="SQI1BDBASEADD" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="BDADDR"/>
         </register>
         <register caption="SQI Buffer Descriptor Status Register" name="SQI1BDSTAT" offset="0x44" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="BDCON"/>
            <bitfield caption="DMA Buffer Descriptor Processor Active Status bit" mask="0x00010000" name="DMAACTV" values="SQI1BDSTAT__DMAACTV"/>
            <bitfield caption="DMA Buffer Descriptor Processor Start Status bit" mask="0x00020000" name="DMASTART" values="SQI1BDSTAT__DMASTART"/>
            <bitfield caption="DMA Buffer Descriptor Processor State Status bits" mask="0x003C0000" name="BDSTATE" values="SQI1BDSTAT__BDSTATE"/>
         </register>
         <register caption="SQI Buffer Descriptor Poll Control Register" name="SQI1BDPOLLCON" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="POLLCON"/>
         </register>
         <register caption="SQI Buffer Descriptor DMA Transmit Status Register" name="SQI1BDTXDSTAT" offset="0x4c" rw="R" size="4">
            <bitfield mask="0x000001FF" name="TXCURBUFLEN"/>
            <bitfield mask="0x001F0000" name="TXBUFCNT"/>
            <bitfield mask="0x1E000000" name="TXSTATE"/>
         </register>
         <register caption="SQI Buffer Descriptor DMA Receive Status Register" name="SQI1BDRXDSTAT" offset="0x50" rw="R" size="4">
            <bitfield mask="0x000001FF" name="RXCURBUFLEN"/>
            <bitfield mask="0x001F0000" name="RXBUFCNT"/>
            <bitfield mask="0x1E000000" name="RXSTATE"/>
         </register>
         <register caption="SQI Threshold Control Register" name="SQI1THR" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="THRES"/>
         </register>
         <register caption="SQI Interrupt Signal Enable Register" name="SQI1INTSIGEN" offset="0x58" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Empty Interrupt Signal Enable bit" mask="0x00000001" name="TXEMPTYISE" values="SQI1INTSIGEN__TXEMPTYISE"/>
            <bitfield caption="Transmit Buffer Full Interrupt Signal Enable bit" mask="0x00000002" name="TXFULLISE" values="SQI1INTSIGEN__TXFULLISE"/>
            <bitfield caption="Transmit Buffer Threshold Interrupt Signal Enable bit" mask="0x00000004" name="TXTHRISE" values="SQI1INTSIGEN__TXTHRISE"/>
            <bitfield caption="Receive Buffer Empty Interrupt Signal Enable bit" mask="0x00000008" name="RXEMPTYISE" values="SQI1INTSIGEN__RXEMPTYISE"/>
            <bitfield caption="Receive Buffer Full Interrupt Signal Enable bit" mask="0x00000010" name="RXFULLISE" values="SQI1INTSIGEN__RXFULLISE"/>
            <bitfield caption="Receive Buffer Threshold Interrupt Signal Enable bit" mask="0x00000020" name="RXTHRISE" values="SQI1INTSIGEN__RXTHRISE"/>
            <bitfield caption="Control Buffer Full Interrupt Signal Enable bit" mask="0x00000040" name="CONFULLISE" values="SQI1INTSIGEN__CONFULLISE"/>
            <bitfield caption="Control Buffer Empty Interrupt Signal Enable bit" mask="0x00000080" name="CONEMPTYISE" values="SQI1INTSIGEN__CONEMPTYISE"/>
            <bitfield caption="Control Buffer Threshold Interrupt Signal Enable bit" mask="0x00000100" name="CONTHRISE" values="SQI1INTSIGEN__CONTHRISE"/>
            <bitfield caption="DMA Buffer Descriptor Done Interrupt Signal Enable bit" mask="0x00000200" name="BDDONEISE" values="SQI1INTSIGEN__BDDONEISE"/>
            <bitfield caption="DMA Buffer Descriptor Packet Complete Interrupt Signal Enable bit" mask="0x00000400" name="PKTCOMPISE" values="SQI1INTSIGEN__PKTCOMPISE"/>
            <bitfield caption="DMA Bus Error Interrupt Signal Enable bit" mask="0x00000800" name="DMAEISE" values="SQI1INTSIGEN__DMAEISE"/>
         </register>
         <register caption="SQI Tap Control Register" name="SQI1TAPCON" offset="0x5c" rw="RW" size="4">
            <bitfield caption="SQI Clock Output Delay bits" mask="0x0000000F" name="CLKOUTDLY" values="SQI1TAPCON__CLKOUTDLY"/>
            <bitfield caption="SQI Data Output Delay bits" mask="0x000000F0" name="DATAOUTDLY" values="SQI1TAPCON__DATAOUTDLY"/>
            <bitfield caption="SQI Clock Input Delay bits" mask="0x00003F00" name="SDRCLKINDLY" values="SQI1TAPCON__SDRCLKINDLY"/>
            <bitfield mask="0x000F0000" name="DDRDATINDLY"/>
            <bitfield mask="0x00F00000" name="SDRDATINDLY"/>
            <bitfield mask="0x3F000000" name="DDRCLKINDLY"/>
         </register>
         <register caption="SQI Memory Status Register" name="SQI1MEMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STATCMD"/>
            <bitfield caption="Number of Status Bytes bits" mask="0x00030000" name="STATBYTES" values="SQI1MEMSTAT__STATBYTES"/>
            <bitfield caption="Status Command/Read Lane Mode bits" mask="0x000C0000" name="STATTYPE" values="SQI1MEMSTAT__STATTYPE"/>
            <bitfield caption="Statis Bit Position in Flash bit" mask="0x00100000" name="STATPOS" values="SQI1MEMSTAT__STATPOS"/>
         </register>
         <register caption="SQI XIP Control Register 3" name="SQI1XCON3" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="INIT1CMD1"/>
            <bitfield mask="0x0000FF00" name="INIT1CMD2"/>
            <bitfield mask="0x00FF0000" name="INIT1CMD3"/>
            <bitfield caption="Flash Initialization 1 Command Type bits" mask="0x03000000" name="INIT1TYPE" values="SQI1XCON3__INIT1TYPE"/>
            <bitfield caption="Flash Initialization 1 Command Count bits" mask="0x0C000000" name="INIT1COUNT" values="SQI1XCON3__INIT1COUNT"/>
            <bitfield caption="Flash Initialization 1 Command Status Check bit" mask="0x10000000" name="INIT1SCHECK" values="SQI1XCON3__INIT1SCHECK"/>
         </register>
         <register caption="SQI XIP Control Register 4" name="SQI1XCON4" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="INIT2CMD1"/>
            <bitfield mask="0x0000FF00" name="INIT2CMD2"/>
            <bitfield mask="0x00FF0000" name="INIT2CMD3"/>
            <bitfield caption="Flash Initialization 2 Command Type bits" mask="0x03000000" name="INIT2TYPE" values="SQI1XCON4__INIT2TYPE"/>
            <bitfield caption="Flash Initialization 2 Command Count bits" mask="0x0C000000" name="INIT2COUNT" values="SQI1XCON4__INIT2COUNT"/>
            <bitfield caption="Flash Initialization 2 Command Status Check bit" mask="0x10000000" name="INIT2SCHECK" values="SQI1XCON4__INIT2SCHECK"/>
         </register>
      </register-group>
      <value-group caption="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." name="SQI1XCON1__TYPECMD">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Quad Lane mode command is enabled" name="" value="0x2"/>
         <value caption="Dual Lane mode command is enabled" name="" value="0x1"/>
         <value caption="Single Lane mode command is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." name="SQI1XCON1__TYPEADDR">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Quad Lane mode address is enabled" name="" value="0x2"/>
         <value caption="Dual Lane mode address is enabled" name="" value="0x1"/>
         <value caption="Single Lane mode address is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." name="SQI1XCON1__TYPEMODE">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Quad Lane mode is enabled" name="" value="0x2"/>
         <value caption="Dual Lane mode is enabled" name="" value="0x1"/>
         <value caption="Single Lane mode is enabled" name="" value="0x0"/>
      </value-group>
