Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFF100.atdf
         <register caption="UARTx Mode Register" name="U5MODE" offset="0x800" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U5MODE__STSEL"/>
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U5MODE__PDSEL"/>
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U5MODE__BRGH"/>
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U5MODE__RXINV"/>
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U5MODE__ABAUD"/>
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U5MODE__LPBACK"/>
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U5MODE__WAKE"/>
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U5MODE__UEN"/>
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U5MODE__RTSMD"/>
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U5MODE__IREN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U5MODE__SIDL"/>
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U5MODE__ON"/>
         </register>
         <register caption="UARTx Mode Register" name="U6MODE" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U6MODE__STSEL"/>
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U6MODE__PDSEL"/>
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U6MODE__BRGH"/>
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U6MODE__RXINV"/>
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U6MODE__ABAUD"/>
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U6MODE__LPBACK"/>
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U6MODE__WAKE"/>
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U6MODE__UEN"/>
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U6MODE__RTSMD"/>
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U6MODE__IREN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U6MODE__SIDL"/>
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U6MODE__ON"/>
         </register>
         <register caption="UARTx Status and Control Register" name="U1STA" offset="0x10" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit" mask="0x00000001" name="URXDA" values="U1STA__URXDA"/>
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U1STA__OERR"/>
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U1STA__FERR"/>
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U1STA__PERR"/>
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U1STA__RIDLE"/>
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U1STA__ADDEN"/>
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U1STA__URXISEL"/>
            <bitfield mask="0x00000100" name="TRMT"/>
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000200" name="UTXBF" values="U1STA__UTXBF"/>
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U1STA__UTXEN"/>
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U1STA__UTXBRK"/>
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U1STA__URXEN"/>
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U1STA__UTXINV"/>
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U1STA__UTXISEL"/>
            <bitfield mask="0x00FF0000" name="ADDR"/>
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U1STA__ADM_EN"/>
         </register>
         <register caption="UARTx Status and Control Register" name="U2STA" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URXDA"/>
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U2STA__OERR"/>
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U2STA__FERR"/>
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U2STA__PERR"/>
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U2STA__RIDLE"/>
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U2STA__ADDEN"/>
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U2STA__URXISEL"/>
            <bitfield mask="0x00000100" name="TRMT"/>
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000200" name="UTXBF" values="U2STA__UTXBF"/>
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U2STA__UTXEN"/>
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U2STA__UTXBRK"/>
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U2STA__URXEN"/>
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U2STA__UTXINV"/>
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U2STA__UTXISEL"/>
            <bitfield mask="0x00FF0000" name="ADDR"/>
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U2STA__ADM_EN"/>
         </register>
